taurus/acceptance_test/acceptance_test2_jmeter.yml
execution:
- executor: jmeter
  concurrency: 10
  ramp-up: 5s
  hold-for: 5s
  scenario: scenario-default

# http://gettaurus.org/docs/ScenarioBuilding/
scenarios:
  scenario-default:
    default-address:
    requests:
    - url: /api/courses
      #think-time: 10
      method: GET
      headers:
        Content-Type: application/json
      assert:
      - contains:
        - Course 1
        - Course 2
        - Course 3
        - Course 4
        - Course 5
        subject: body

reporting:
  - module: final-stats
    dump-xml: scenario-default-acceptance-health-jmeter-stats.xml